Merge pull request #17 from brunob54/BB/user-guide
docs: user guide + README modernization
